notebooks/intro_matlab_solutions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-23 Thu 21:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Solutions to questions in Intro to MATLAB notebook</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Gustavo" />
<link rel="stylesheet" href="https://gongzhitaao.org/orgcss/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">Solutions to questions in Intro to MATLAB notebook</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org35bb261">1. Exercises</a></li>
</ul>
</div>
</div>

<div id="outline-container-org35bb261" class="outline-2">
<h2 id="org35bb261"><span class="section-number-2">1</span> Exercises</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><p>
Create a 15x1 vector where each component is drawn independent from a Uniform[0, 1] distribution
</p>

<p>
<b>A:</b> Use rand command. <code>randn(15, 1)</code> should do the trick.
</p></li>
<li><p>
Create a 2x2 matrix where all elements but (2,1) are independent standard normal, and entry (2,1) is uniform[0,1].
</p>

<p>
<b>A:</b> Create a 2x2 standard normal matrix, substitute element (2,1).
</p>
<div class="org-src-container">
<pre class="src src-matlab">rng(44)
m2 = randn(2,2);
m2<span style="color: #6434A3;">(2,1) </span>= rand
</pre>
</div>

<pre class="example">
rng(44)
m2 = randn(2,2);
m2(2,1) = rand

m2 =

    0.9517    0.8655
    0.3593   -0.2708
</pre></li>
<li><p>
Create a 2x2 matrix where all elements are drawn independent U[-1, 2]
</p>

<p>
<b>A:</b> Expand the uniform to [0,3] and translate by -1. 
</p>
<div class="org-src-container">
<pre class="src src-matlab">rng(44) <span style="color: #8D8D84; font-style: italic;">% For reproducibility</span>

m3_init = rand(2,2);
m3 = m3_init <span style="color: #6434A3;">*</span> 3 <span style="color: #6434A3;">-</span> 1
</pre>
</div></li>
<li><p>
Create a 2x2 matrix where all elements are drawn independent N(1, 0.16)
</p>

<p>
<b>A.</b> Do a similar shift/expand trick. Remember that if \(X \sim N(0,1)\), then
      \[ \sigma X + \mu \sim N(\mu, \sigma^2) \]
</p>

<div class="org-src-container">
<pre class="src src-matlab">rng(44);  <span style="color: #8D8D84; font-style: italic;">% For reproducibility</span>

sig = sqrt(0.16);
mu = 1;

m4_init = randn(2,2);
m4 = mu <span style="color: #6434A3;">+</span> sig <span style="color: #6434A3;">*</span>  m4_init
</pre>
</div>

<pre class="example">
rng(44);  % For reproducibility
sig = sqrt(0.16);
mu = 1;
m4_init = randn(2,2);
m4 = mu + sig *  m4_init

m4 =

    1.3807    1.3462
    0.8389    0.8917
</pre></li>
<li><p>
Create a vector, with arbitrary length, where each entry is one of
\(\{1,2,3,4\}\) according to the probability mass specification (0.01, 0.09,
0.8, 0.1)
</p>

<p>
<b>A.</b> Let \(\mathbf p = (0.01, 0.09, 0.8, 0.1)\). Take a uniform random draw from
[0,1], say \(U\). Then consider the following rule: 
</p>

\begin{equation} 
\label{org6841851}
F(U) = \begin{cases} 
    1 & \text{if } U \leq 0.01 \\
    2 & \text{if } 0.01 < U \leq 0.01 + 0.09 \\
    3 & \text{if } 0.01 + 0.09 < U \leq 0.01 + 0.09 + 0.8 \\
    4 & \text{if } 0.01 + 0.09 + 0.8 < U \leq 0.01 + 0.09 + 0.8 + 0.1 
\end{cases}
\end{equation}

<p>
It's not hard to verify that \(\Pr \{ F(U) = 1 \} = 0.01\), \(\Pr \{ F(U) = 2 \} = 0.01\),
\(\Pr \{ F(U) = 3 \} = 0.8\) and \(\Pr \{ F(U) = 4 \} = 0.1\). Now, how do we implement this? 
</p>

<p>
Note that \(F\) is basically comparing \(U\) above against the <i>cumulative sum</i> of \(p\). Matlab has a command for cumulative sums: 
</p>
<div class="org-src-container">
<pre class="src src-matlab">p = [0.01, 0.09, 0.8, 0.1];
cum_p = cumsum(p)
</pre>
</div>

<pre class="example">
p = [0.01, 0.09, 0.8, 0.1];
cum_p = cumsum(p)

cum_p =

    0.0100    0.1000    0.9000    1.0000
</pre>


<p>
Let's define something slightly more general than \(F\). We define a function
that, for any u, finds the <b>first</b> entry of the cumulative sum of \(\mathbf
     p\) smaller than U. This is done below, for general scalar u and vector p
whose cumulative sum has been computed in advance.
</p>
<div class="org-src-container">
<pre class="src src-matlab"><span style="color: #8D8D84; font-style: italic;">% Tangled by intro_matlab_solutions.org</span>

<span style="color: #0000FF;">function</span> <span style="color: #BA36A5;">jj</span> = <span style="color: #006699;">cumsum_findsmaller</span>(<span style="color: #BA36A5;">u</span>, <span style="color: #BA36A5;">cum_p</span>)
    jj = 0;
    is_lower = <span style="color: #D0372D;">false</span>;
    <span style="color: #0000FF;">while</span> <span style="color: #6434A3;">~</span>is_lower    <span style="color: #8D8D84; font-style: italic;">% continue until is_lower becomes true</span>
        jj = jj <span style="color: #6434A3;">+</span> 1;
        is_lower = (u <span style="color: #6434A3;">&lt;=</span> cum_p(jj)); <span style="color: #8D8D84; font-style: italic;">% logical variable: either 0 or 1</span>
    <span style="color: #0000FF;">end</span>
<span style="color: #0000FF;">end</span>
</pre>
</div>
<ul class="org-ul">
<li>Convince yourself that this does exactly what \(F\) above prescribes</li>
</ul>

<p>
The code above is saved in <code>extracode/cumsum_findsmaller.m</code>. Let's apply it
at several possible values of \(u\) to check that it matches \eqref{org6841851}.
</p>
<div class="org-src-container">
<pre class="src src-matlab">addpath(<span style="color: #008000;">'extracode'</span>) <span style="color: #8D8D84; font-style: italic;">% make sure `cumsum_findsmaller.m` is reachable</span>

cumsum_findsmaller(0.005, cum_p) <span style="color: #8D8D84; font-style: italic;">% should  be 1</span>

cumsum_findsmaller(0.07, cum_p) <span style="color: #8D8D84; font-style: italic;">%  should be 2</span>

cumsum_findsmaller(0.5, cum_p)  <span style="color: #8D8D84; font-style: italic;">% should be 3</span>
</pre>
</div>

<pre class="example">
addpath('extracode') % make sure `cumsum_findsmaller.m` is reachable
cumsum_findsmaller(0.005, cum_p) % should  be 1

ans =

     1
cumsum_findsmaller(0.07, cum_p) %  should be 2

ans =

     2
cumsum_findsmaller(0.5, cum_p)  % should be 3

ans =

     3
</pre>

<p>
Seems about right. Now let's generate a sample: 
</p>

<div class="org-src-container">
<pre class="src src-matlab">rng(44)

sample_size = 1000;    <span style="color: #8D8D84; font-style: italic;">% arbitrary sample size</span>

<span style="color: #0000FF;">tic</span>;
store_sample = zeros(sample_size, 1); <span style="color: #8D8D84; font-style: italic;">%  pre-allocate sample vector</span>

<span style="color: #0000FF;">for</span> <span style="color: #BA36A5;">ii</span>=<span style="color: #D0372D;">1:sample_size</span>
    U=rand;
    store_sample(ii)=cumsum_findsmaller(U, cum_p);
<span style="color: #0000FF;">end</span>
<span style="color: #0000FF;">toc</span>;

</pre>
</div>

<p>
Notice that the above solution has in practice two loops:  
</p>
<ul class="org-ul">
<li>One inside the function <code>cumsum_findsmaller</code></li>
<li>The loop ranging from <code>ii=1:samplesize</code>.</li>
</ul>
<p>
That goes against the general advice that we should avoid this type of
construction. How then would you proceed with built-in matrix operations?
</p>

<p>
One (garbled and non-intuitive) way of doing it without loops is shown below. 
</p>

<div class="org-src-container">
<pre class="src src-matlab">
rng(44)

<span style="color: #0000FF;">tic</span>; 

unifsamp = rand(1, sample_size);
rep_matrix = repmat(unifsamp, 4, 1);
store_sample_v = sum(cum_p<span style="color: #6434A3;">'</span> <span style="color: #6434A3;">&lt;</span> rep_matrix)<span style="color: #6434A3;">+</span>1;


<span style="color: #0000FF;">toc</span>;
</pre>
</div>

<pre class="example">
rng(44)
tic;
unifsamp = rand(1, sample_size);
rep_matrix = repmat(unifsamp, 4, 1);
store_sample_v = sum(cum_p' &lt; rep_matrix)+1;
toc;
Elapsed time is 0.018616 seconds.
</pre></li>
</ol>


<p>
In this case, there doesn't seem to be a clear benefit of using matrix
operations instead of loops.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>

<ol class="org-ol">
<li><p>
How do you tell if the draw in (5) was reasonable?
</p>

<p>
<b>A.</b> We can check, for example, the frequency that number \(3\) shows up.
Because it has probability 80%, we'd expect the relative frequency to be
around 80%. This is checked below: 
</p>

<div class="org-src-container">
<pre class="src src-matlab">
sum(store_sample <span style="color: #6434A3;">==</span> 3) <span style="color: #6434A3;">/</span> length(store_sample)
sum(store_sample_v <span style="color: #6434A3;">==</span> 3) <span style="color: #6434A3;">/</span> length(store_sample_v)

</pre>
</div>

<pre class="example">
sum(store_sample == 3) / length(store_sample)

ans =

    0.8060
sum(store_sample_v == 3) / length(store_sample_v)

ans =

    0.8060
</pre></li>
</ol>


<p>
Which is around 80% of the time, indicating that we're sampling from the
right distribution.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
There is a reason for that: MATLAB has been improving the way it does
just-in-time compilation. The function <code>cumsum_findsmaller</code> was likely JIT
compiled. For this to happen, you have to write separate functions.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Gustavo</p>
<p class="date">Created: 2020-01-23 Thu 21:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
